/*
 * 
 * 1.프로젝트명 설정
 * 2.src => java파일 생성
 * 3.java : 단위가 클래스
 * 	클래스 생성
 * -----------------
 * 	1.클래스는 대문자로 시작
 * 	2.단어가 2개이상일 경우
 * 		시작하는 첫자는 대문자 
 * 		=> Main_Class , File_Name
 *  3.자바에서  숫자 표현	: 	 8진법: 011
 * 						 10진법 
 * 						 16진법 : OxFF (html 색상 표현)
 *  * 	 	 문자 표현	: 	' 한개의 문자 '  ex '홍'
 * 						 'AB' 오류
 * 			 문자열 표현 : " "여러개 문자열 사용이 가능 " 
 *  4. 문장이 종료되면 ; < = 명령수행
 *  				명령순서 (알고리즘)
 *  5.들여쓰기
 *  
 *  6.자바 실행
 *   ----------
 *   mainClass.java 원시소스(개발자만 알아보는  소스)
 *   컴퓨터 인식(2진법 0 ,1 ) => javac 파일명
 *   
 *   mainClass.class  => 바이트코드로 변경
 *   
 *   
 * 	 실행 : java 
 *   
 *   7. 컴파일 :  컴퓨터 인식언어로 변경
 *   			java / c, c++
 *   	인터프리터 : 한줄씩 번역을 해줌
 *   			html
 *   =================================
 *   자바 : 컴파일+ 인터프리터
 *   		보안이 뛰어남
 *   		
 *   =>자바: 게임에 사용되는 언어(세븐스타)
 *   = 임베디드 = 모바일 
 *   =>그린프로젝트 : 모든 기계를 리모콘 한개로 제어
 *   =>1차부도
 *   =>네스케이프(브라우저 업체) => 웹
 *   =>개별 업체 ( 썬 마이크로 시스템) 
 *   	=> 자바언어 사용
 *   	=> 제임스 고슬린 , 아서벤
 *   		ja			va
 *   =>1995 : 자바 탄생 (5/23) 자바데이
 *   =>1996 : 한국 상륙 =>2000년(jsp)
 *   MS <=> 연합군(오라클, 썬)
  * 		------------
  *  MS(데이터 베이스 : MS-SQL , windows)
  *  SUN(솔라리스) = > 인수 =>MYSQL
  *  	=>부도 2차
 *	오라클 인수 = >JAVA 유료화   
 *   -------------
 *   Java 의 제작 (제임스 고슬린)
 *   	연봉(x) => 구글(Go)
 *   모바일 ( 유료화 => 안드로이드(자바) -> kotlin)
 *   	*** 스프링 (오픈 소스) =>준비(자바, 코틀린 )
 * 
 * 자바 필수
 * 	1.변수(한개의 데이터 저장)
 * 	데이터형 (정수, 실수,문자,,,)
 * --------------------
 * 
 * 	2.가공: 연산자, 제어문
 *  3. 데이터를 모아서 관리 :배열(같은 것만 모은다)
 *  4.다른 데이터를 모아서 관리 : 클래스
 *  5. 클래스:재사용,보안, 수정 , 추가 :객체지향프로그래밍
 *  -----------------------
 *  6.예외처리 
 *  -------------------------
 *  7.라이브러리
 *  ======>IO(파일 입출력) , 오라클 연결
 *  ---------------------
 */			

public class MainClass {
//	프로그램의 시작점 =>메인은 만드시 한개이상이 필요하다.

	public static void main(String[] args) {
		
		
		
			System.out.println("Hello JAVA!!");
		
			
				
				
				
			
		
	}

}
